public enum OrderStatus 
{ 
    New,
    Processing,
    Completed,
    Failed,
    Cancelled 
}

// "В конце вывести результаты и объяснить, почему время выполнения отличается."
// Потому что в режиме последовательной обработки каждый заказ обрабатывается один за другим,
// что приводит к увеличению общего времени выполнения.
// В режиме параллельной обработки несколько заказов обрабатываются одновременно (до 5),
// это позволяет значительно сократить время выполнения,
// так как операции выполняются параллельно, а не последовательно.